Сергей Чередниченко: Всем привет!
Владимир Шепунов: Привет
Александр Кузнецов: 👋
anna: Вопросы по ходу семинара в чат писать?
Сергей Ефанов: Вопросы по ходу семинара в чат писать?
Да
Максим Суханов: 1 группа у нас)
Александр Кузнецов: 😃
Сергей Ефанов: Reacted to "😃" with 👍
Timur Islamgulov: https://quizizz.com/join?gc=239218
Сергей Чередниченко: По другому не выгнать малую ))
Сергей Ефанов: Разработчики
Сергей Чередниченко: фулстак
Timur Islamgulov: https://quizizz.com/join?gc=239218
Юлия Захарченко: Есть Продакт!!
Юлия Захарченко: Почему))
Valeria: Возможно, проджект)
Юлия Захарченко: Пфффф, недооцениваете вы нас))
Оля: 4
kristina: 4
Artem S: как участвовать в quiz? можно ссылку
Artem S: int
Artem S: 1
Artem S: 2 и 3
Максим Суханов: while - пока if если
Сергей Ефанов: Да, даже 1,25 много
Сергей Ефанов: 1 умеренно
Григорий: смотрю х2...
Максим Суханов: -
Анастасия Селенчик: -
Вероника: -
Григорий: -
Александр Мельников: -
Александр Кузнецов: -
Сергей Ефанов: -
Виктория Соловьева: -
Владимир Шепунов: -
Маркова Майя: -
Самодуров Никита: -
Artem S: -
Timur Islamgulov: // Напишите программу, которая на вход принимает число и выдает его квадрат
// (число умноженное на само себя).

// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49
Максим Суханов: Console.WriteLine("Введите число");
Оля: +
Timur Islamgulov: Console.WriteLine("Введите целое число");
int num = Convert.ToInt32( Console.ReadLine()) ;
int result = num * num;
Console.WriteLine(result);
Сергей Ефанов: dotnet run - программа работает)
Виктория Соловьева: да для 1 команды
Timur Islamgulov: Console.WriteLine("Введите целое число");
int num = Convert.ToInt32( Console.ReadLine()) ;
int result = num * num;
Console.WriteLine(result);

if (num>0)
{
Console.WriteLine("Было введено положительное число");
}
else if (num==0)
Console.WriteLine("Был введен ноль");
else
Console.WriteLine("Было введено отрицательное число");
Сергей Ефанов: Классный преподаватель)
Сергей Ефанов: Нет, правда
Timur Islamgulov: Задача №1. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
a = 25, b = 5 -> да
a = 2, b = 10 -> нет
a = 9, b = -3 -> да
a = -3 b = 9 -> нет

Задача №3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
3 -> Среда
5 -> Пятница
Маркова Майя: я делаю ctrl +/
Сергей Чередниченко: 20
Максим Суханов: ой
Timur Islamgulov: https://metanit.com/sharp/tutorial/3.45.php
kristina: // Задача №1. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
// a = 25, b = 5 -> да
// a = 2, b = 10 -> нет
// a = 9, b = -3 -> да
// a = -3 b = 9 -> нет

// Задача №3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница

// Console.WriteLine("введите первое число");
// int num = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("введите второе число");
// int num2 = Convert.ToInt32(Console.ReadLine());
// if (num == num2 * num2)
// {
// Console.WriteLine("первое число - квадрат второго");
// }
// else
// {
// Console.WriteLine("первое число - не квадрат");
// }


Console.WriteLine("введите номер дня недели (1-7)");
int num = Convert.ToInt32(Console.ReadLine());
if (num == 1)
{
Console.WriteLine("понедельник");

}
else if (num == 2)
{
Console.WriteLine("вторник");

}
else if (num == 3)
{
Console.WriteLine("среда");

}
else if (num == 4)
{
Console.W
anna: // Задача №1. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
// a = 25, b = 5 -> да
// a = 2, b = 10 -> нет
// a = 9, b = -3 -> да
// a = -3 b = 9 -> нет



// Console.WriteLine("Введите первое число");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число");
// int num2 = Convert.ToInt32(Console.ReadLine());
// if(num1 == num2 * num2)
// Console.WriteLine("Да");
// else
// Console.WriteLine("Нет");

// Задача №3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница

Console.WriteLine("Введите номер дня недели от 1 до 7");
int day = Convert.ToInt32(Console.ReadLine());
if(day == 1)
Console.WriteLine("Понедельник");
else if(day == 2)
Console.WriteLine("Вторник");
else if(day == 3)
Console.WriteLine("Среда");
else if(day == 4)
Console.WriteLine("Четверг");
else if(day == 5)
Console.WriteLine("Пятница");
else if(day == 6)
Console.WriteLine("Суббота");
else if(day == 7)
Console.WriteLine("Воскресенье");
else
Console.WriteLine("Введите номер дня недели от 1 до 7");
Владимир Шепунов: преобразование типов данных?
Влад: 25 продолжим
Timur Islamgulov: Задача №5. Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.
4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
2 -> " -2, -1, 0, 1, 2"

Задача №7. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
456 -> 6
782 -> 2
918 -> 8
Timur Islamgulov: теперь на входе целое число любой разрядности, надо вывести третью справа цифру
Timur Islamgulov: теперь на входе целое число любой разрядности, надо вывести третью слева цифру
Вероника: А ещё дз будет?
Анастасия Селенчик: Console.WriteLine("Введите число ");
int num = Convert.ToInt32(Console.ReadLine());
int num_min = num*(-1);
int temp = 0;
if (num<0)
{
temp = num;
num = num_min;
num_min = temp;
}

while (num_min < num+1)
{
Console.Write(num_min);
Console.Write(" ");
num_min++;
}
Влад: Через строку нельзя :D
Максим Суханов: 👍
Сергей Ефанов: Спасибо
Влад: 👍🏼