// Задание 3. Работа в сессионных залах
// Напишите программу, которая будет принимать на вход два числа и выводить, 
// является ли первое число кратным второму. Если первое число некратно второму, 
// то программа выводит остаток от деления.
// 
// Примеры
// 14, 5 => нет, 4 16, 8 => да
// 4, 3 => нет, 1


Console.Write("Введите первое число: ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int number2 = Convert.ToInt32(Console.ReadLine());

if(number1 % number2 == 0) Console.WriteLine($"да");
    else Console.WriteLine($"нет, {number1 % number2}");